package kh.java.oop.access.modifire.class_;




//
// 접근제한자 Access Modifier(점근제어자)
//
//	1.public	  =>다른패키지, 다른클래스 모두가능
//	2.protected	  =>같은패키지 다른패키지라도 상속관계는 ok
//  3.default	  =>같은 패키지에서만 접근가능
//	(작성안하면 자동으로디폴트)
//	4.private     =>같은클래스
//
//	Class =>클레스앞에 붙일수있는경우는 두가지 접근제어자가잇다.
//	1. public 다른패키지 다른클래스 사용가능
//	2. default(작성금지) 같은패키지
//

public class Apple {
		
		
		
		
	}

//	Class =>클레스앞에 붙일수있는경우는 두가지 접근제어자가잇다.
//	1. public 다른패키지 다른클래스 사용가능  =>퍼블릭 클래스는 .java한 파일안에 한개만작성가능하다.
//	2. default(작성금지) 같은패키지
//
	//퍼블릭클래스  다른패키지 다른클래스 사용가능
  //디펄드클래스 같은 패키지 사용가능

//
// 객체지향 프로그래밍: 완성된 클래스를 모듈로써 가져다 쓰도록 제공하는것.
//	=>그러한이유로 디펄트 클래스는 사용하지않는다. 

//===>즉 그래서 클래스는 public 하나만 으로 작성한다 생각하면된다.
  class PineApple{
	  
  }
  //
